Documents/ВводОстатковТМЦВЭксплуатации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Document>
		<Properties>
			<Name>ВводОстатковТМЦВЭксплуатации</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.ИсправленияДокументов</xr:Item>
				<xr:Item>AccumulationRegister.УдалитьТМЦВЭксплуатации</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтражатьВОперативномУчете</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтражатьВБУиНУ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтражатьВУУ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Исправление</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсправляемыйДокумент</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ВводОстатковТМЦВЭксплуатации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СторнируемыйДокумент</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ВводОстатковТМЦВЭксплуатации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХозяйственнаяОперация</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ХозяйственныеОперации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Префикс</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>4</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ТМЦВЭксплуатации</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Характеристика</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоПоРНПТ</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>23</v8:Digits>
									<v8:FractionDigits>11</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаНеотрицательная</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаПР</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаВР</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПервоначальнаяСумма</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаНеотрицательная</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПервоначальнаяСуммаУпр</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаНеотрицательная</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КатегорияЭксплуатации</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КатегорииЭксплуатации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатьяРасходов</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.СтатьиРасходов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АналитикаРасходов</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.СтатьиРасходов</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФизическоеЛицо</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаНачалаЭксплуатации</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИнвентарныйНомер</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ИнвентарныйНомерТМЦВЭксплуатации</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Серия</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерГТД</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.НомераГТД</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатусУказанияСерий</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>2</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НаправлениеДеятельности</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.НаправленияДеятельности</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОсновноеСредство</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Партия</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПартииТМЦВЭксплуатации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторСтроки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>36</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УдалитьПартияТМЦВЭксплуатации</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПартииТМЦВЭксплуатации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Catalogs/ХарактеристикиНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<Name>ХарактеристикиНоменклатуры</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.ВидыНоменклатуры</xr:Item>
				<xr:Item>Catalog.Номенклатура</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НаименованиеПолное</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Принципал</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
						<v8:Type>cfg:CatalogRef.Партнеры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КиЗГИСМGTIN</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.GTIN</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХарактеристикаНоменклатурыДляЦенообразования</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатурыДляЦенообразования</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Представления</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>КодЯзыка</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НаименованиеПолное</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>1024</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Наименование</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/НомераГТД.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<Name>НомераГТД</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>СтранаПроисхождения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтраныМира</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РегистрационныйНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>29</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтранаВвозаНеРФ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПорядковыйНомерТовара</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>3</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьРНПТ</Name>
					<Comment>Это регистрационный номер партии товара, подлежащей прослеживаемости</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипНомераГТД</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыНомеровГТД</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоКомплектующих</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеТовара</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаПоРНПТ</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаНеотрицательная</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПрослеживаемыеКомплектующие</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>НомерРНПТ</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.НомераГТД</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоПоРНПТ</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>23</v8:Digits>
									<v8:FractionDigits>11</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницаИзмеренияТНВЭД</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УпаковкиЕдиницыИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаПоРНПТ</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаНеотрицательная</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

CommonModules/ТМЦВЭксплуатацииКлиентСервер/Ext/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// Процедуры подсистемы "ТМЦ в эксплуатации".
// 
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Параметры подбора ТМЦ в эксплуатации.
// 
// Параметры:
//  Дата - Дата - На какую дату подбираются ТМЦ.
//  Организация - СправочникСсылка.Организации - Отбор ТМЦ по организации.
//  Подразделение - СправочникСсылка.СтруктураПредприятия - Отбор ТМЦ по подразделению.
// 
// Возвращаемое значение:
//  Структура - содержит:
//		* Дата - Дата, Неопределено - На какую дату подбираются ТМЦ.
//		* Организация - СправочникСсылка.Организации, Неопределено - Отбор ТМЦ по организации.
//		* Подразделение - СправочникСсылка.СтруктураПредприятия, Неопределено - Отбор ТМЦ по подразделению.
//		* Номенклатура - СправочникСсылка.Номенклатура, Неопределено - Отбор ТМЦ по номенклатуре.
//		* Характеристика - СправочникСсылка.ХарактеристикиНоменклатуры, Неопределено - Отбор ТМЦ по характеристике.
//		* Серия - СправочникСсылка.СерииНоменклатуры, Неопределено - Отбор ТМЦ по серии.
//		* СтатусУказанияСерий - Число, Неопределено - Для отбора ТМЦ по серии.
//		* ФизическоеЛицо - СправочникСсылка.ФизическиеЛица, Неопределено - Отбор ТМЦ по физ. лицу.
//		* СпособПогашенияСтоимостиБУ - ПеречислениеСсылка.СпособыПогашенияСтоимостиТМЦ, Неопределено - Отбор способу погашения стоимости.
//		* ИнвентарныйНомер - Строка, Неопределено - Отбор ТМЦ по инвентарному номеру.
//		* ИнвентарныйНомерСодержит - Строка, Неопределено - Отбор ТМЦ по совпадению текста в инвентарном номере.
//		* ВыбратьПервые - Число - Выбрать первые записи.
//		* ИнвентарныйУчет - Число, Неопределено - Отбор ТМЦ по признаку инвентарного учета (0 - Любой, 1 - Не ведется, 2 - Ведется).
//		* НазначенныйРесурс - Строка - (Выработан, НеВыработан).
//		* ТекущийРегистратор - ДокументСсылка, Неопределено - Заполняется, если нужно учесть изменение остатков документом.
//		* ДатаНачалаЭксплуатацииС - Дата - Отбор по дате начала эксплуатации.
//		* ДатаНачалаЭксплуатацииПо - Дата - Отбор по дате начала эксплуатации.
//		* ДляДинамическогоСписка - Булево - Истина, если подбор выполняется в дин. списке.
//	
Функция ПараметрыПодбораТМЦВЭксплуатации(Дата = Неопределено, Организация = Неопределено, Подразделение = Неопределено) Экспорт
	
	ПараметрыПодбора = Новый Структура;
	ПараметрыПодбора.Вставить("Дата", Дата);
	ПараметрыПодбора.Вставить("Организация", Организация);
	ПараметрыПодбора.Вставить("Подразделение", Подразделение);
	ПараметрыПодбора.Вставить("Номенклатура", Неопределено);
	ПараметрыПодбора.Вставить("Характеристика", Неопределено);
	ПараметрыПодбора.Вставить("Серия", Неопределено);
	ПараметрыПодбора.Вставить("СтатусУказанияСерий", Неопределено);
	ПараметрыПодбора.Вставить("СтатусУказанияСерийОтправитель", Неопределено);
	ПараметрыПодбора.Вставить("ФизическоеЛицо", Неопределено);
	ПараметрыПодбора.Вставить("СпособПогашенияСтоимостиБУ", Неопределено);
	ПараметрыПодбора.Вставить("ТекущийРегистратор", Неопределено);
	ПараметрыПодбора.Вставить("ИнвентарныйНомер", Неопределено);
	ПараметрыПодбора.Вставить("ИнвентарныйНомерСодержит", Неопределено);
	ПараметрыПодбора.Вставить("ВыбратьПервые", 0);	
	ПараметрыПодбора.Вставить("НазначенныйРесурс", Неопределено);	
	ПараметрыПодбора.Вставить("ИнвентарныйУчет", 0);
	ПараметрыПодбора.Вставить("ДатаНачалаЭксплуатацииС", '000101010000');	
	ПараметрыПодбора.Вставить("ДатаНачалаЭксплуатацииПо", '000101010000');	
	ПараметрыПодбора.Вставить("ДляДинамическогоСписка", Ложь);	
	
	Возврат ПараметрыПодбора;
	
КонецФункции

// Параметры заполнения признаков категории эксплуатации.
// 
// Возвращаемое значение:
//  Структура - Параметры заполнения признаков категории эксплуатации:
//		* ЗаполнитьСтатьюРасходов - Булево -
//		* ЗаполнитьСтатьюРасходовДляГрупповогоОС - Булево -
//		* ЗаполнитьСрокЭксплуатации - Булево -
Функция ПараметрыЗаполненияПризнаковКатегорииЭксплуатации() Экспорт

	ПараметрыЗаполнения = Новый Структура;
	ПараметрыЗаполнения.Вставить("ЗаполнитьСтатьюРасходов", Истина);
	ПараметрыЗаполнения.Вставить("ЗаполнитьСтатьюРасходовДляГрупповогоОС", Истина);
	ПараметрыЗаполнения.Вставить("ЗаполнитьСрокЭксплуатации", Ложь);
	
	Возврат ПараметрыЗаполнения;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ВводОстатковТМЦВЭксплуатации

Функция ЗначенияСвойствЗависимыхРеквизитов_ВводОстатковТМЦВЭксплуатации(Объект, ДопПараметры, ИзмененныеРеквизиты = "") Экспорт
	
	СтруктураИзмененныхРеквизитов = Новый Структура(ИзмененныеРеквизиты);
	ОбновитьВсе = СтруктураИзмененныхРеквизитов.Количество() = 0;
	
	ПараметрыРеквизитовОбъекта = Новый Массив;

	Если СтруктураИзмененныхРеквизитов.Свойство("Дата")
		ИЛИ ОбновитьВсе Тогда
			
		ЗначениеСвойства = Ложь;
	
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"ТМЦВЭксплуатации.ПервоначальнаяСумма", 
			"ТМЦВЭксплуатацииПервоначальнаяСумма", 
			"АвтоОтметкаНезаполненного", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
		
	КонецЕсли;
	
	Если СтруктураИзмененныхРеквизитов.Свойство("Дата")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("Организация")
		ИЛИ ОбновитьВсе Тогда
		
		ЗначениеСвойства = НЕ ДопПараметры.СтоимостьСписана;
		
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"ТМЦВЭксплуатации.СтатьяРасходов", 
			"ТМЦВЭксплуатацииСтатьяРасходов", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"ТМЦВЭксплуатации.АналитикаРасходов", 
			"ТМЦВЭксплуатацииАналитикаРасходов", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"ТМЦВЭксплуатации.Сумма", 
			"ТМЦВЭксплуатацииСумма", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
		
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"ТМЦВЭксплуатации.СуммаВР", 
			"ТМЦВЭксплуатацииСуммаВР", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
		
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"ТМЦВЭксплуатации.СуммаПР", 
			"ТМЦВЭксплуатацииСуммаПР", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
		
	КонецЕсли;
	
	Возврат ПараметрыРеквизитовОбъекта;
	
КонецФункции

#КонецОбласти


#Область КатегорииЭксплуатации

// 
// Параметры:
//  Объект - СправочникОбъект.КатегорииЭксплуатации, ДанныеФормыСтруктура - 
// 	ИзмененныеРеквизиты - Строка - список измененных реквизитов.
// 	
// Возвращаемое значение:
// 	Массив из см. НовыйПараметрРеквизитаОбъекта 
Функция ЗначенияСвойствЗависимыхРеквизитов_КатегорииЭксплуатации(Объект, ИзмененныеРеквизиты = "") Экспорт

	СтруктураИзмененныхРеквизитов = Новый Структура(ИзмененныеРеквизиты);
	ОбновитьВсе = СтруктураИзмененныхРеквизитов.Количество() = 0;
	
	ПараметрыРеквизитовОбъекта = Новый Массив;


	Возврат ПараметрыРеквизитовОбъекта;

КонецФункции

#КонецОбласти

#Область ОпределениеСвойствЗависимыхРеквизитовОбъекта

// 
// Параметры:
//  Объект - ДокументОбъект.СписаниеИзЭксплуатации - 
// 	ВспомогательныеРеквизиты - Структура - 
// 	ИзмененныеРеквизиты - Строка - список измененных реквизитов.
// 	
// Возвращаемое значение:
// 	Массив из см. ОбщегоНазначенияУТКлиентСервер.НовыйПараметрРеквизитаОбъекта 
Функция ЗначенияСвойствЗависимыхРеквизитов_СписаниеИзЭксплуатации(Объект, ВспомогательныеРеквизиты, ИзмененныеРеквизиты = "") Экспорт
	
	СтруктураИзмененныхРеквизитов = Новый Структура(ИзмененныеРеквизиты);
	ОбновитьВсе = СтруктураИзмененныхРеквизитов.Количество() = 0;
	
	ПараметрыРеквизитовОбъекта = Новый Массив;

	Если СтруктураИзмененныхРеквизитов.Свойство("Дата")
		ИЛИ ОбновитьВсе Тогда
		
		ЗначениеСвойства = ВспомогательныеРеквизиты.ИспользоватьУчетПрослеживаемыхТоваров;
										
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"Товары.НомерГТД", 
			"ТоварыНомерГТД", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);

		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"Товары.КоличествоПоРНПТ", 
			"ТоварыКоличествоПоРНПТ", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);

	КонецЕсли;
	
	Возврат ПараметрыРеквизитовОбъекта;
		
КонецФункции

#КонецОбласти

#Область Прочее

// Формирует новое значение выбора партии ТМЦ.
// 
// Возвращаемое значение:
//  Структура - содержит:
// 		* Номенклатура - СправочникСсылка.Номенклатура -
// 		* Характеристика - СправочникСсылка.ХарактеристикиНоменклатуры -
// 		* Серия - СправочникСсылка.СерииНоменклатуры -
// 		* Партия - СправочникСсылка.ПартииТМЦВЭксплуатации -
// 		* ФизическоеЛицо - СправочникСсылка.ФизическиеЛица -
// 		* НаправлениеДеятельности - СправочникСсылка.НаправленияДеятельности
// 		* ИнвентарныйНомер - Строка -
// 		* Подразделение - СправочникСсылка.СтруктураПредприятия -
// 		* НомерГТД - СправочникСсылка.НомераГТД -
// 		* ИнвентарныйУчет - Булево -
// 		* УчетПоФизЛицам - Булево -
// 		* ОбъемНаработки - Число - 
// 		* ДатаЗавершенияЭксплуатации - Дата -
// 		* Количество - Число -
// 		* КоличествоУпаковок - Число -
// 		* КоличествоПоРНПТ - Число -
Функция НовоеЗначениеВыбора() Экспорт
	
	ЗначениеВыбора = Новый Структура;
	
	ЗначениеВыбора.Вставить("Номенклатура", ПредопределенноеЗначение("Справочник.Номенклатура.ПустаяСсылка"));
	ЗначениеВыбора.Вставить("Характеристика", ПредопределенноеЗначение("Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка"));
	ЗначениеВыбора.Вставить("Серия", ПредопределенноеЗначение("Справочник.СерииНоменклатуры.ПустаяСсылка"));
	ЗначениеВыбора.Вставить("Партия", ПредопределенноеЗначение("Справочник.ПартииТМЦВЭксплуатации.ПустаяСсылка"));
	ЗначениеВыбора.Вставить("ФизическоеЛицо", ПредопределенноеЗначение("Справочник.ФизическиеЛица.ПустаяСсылка"));
	ЗначениеВыбора.Вставить("НаправлениеДеятельности", ПредопределенноеЗначение("Справочник.НаправленияДеятельности.ПустаяСсылка"));
	ЗначениеВыбора.Вставить("ИнвентарныйНомер", "");
	ЗначениеВыбора.Вставить("Подразделение", ПредопределенноеЗначение("Справочник.СтруктураПредприятия.ПустаяСсылка"));
	ЗначениеВыбора.Вставить("НомерГТД", ПредопределенноеЗначение("Справочник.НомераГТД.ПустаяСсылка"));
	ЗначениеВыбора.Вставить("ИнвентарныйУчет", Ложь);
	ЗначениеВыбора.Вставить("УчетПоФизЛицам", Ложь);
	ЗначениеВыбора.Вставить("ОбъемНаработки", 0);
	ЗначениеВыбора.Вставить("ДатаЗавершенияЭксплуатации", '000101010000');
	ЗначениеВыбора.Вставить("Количество", 0);
	ЗначениеВыбора.Вставить("КоличествоУпаковок", 0);
	ЗначениеВыбора.Вставить("КоличествоПоРНПТ", 0);
	
	Возврат ЗначениеВыбора;
	
КонецФункции


// Формирует описание запроса для выбора партии ТМЦ.
// 
// Параметры:
//  Параметры - см. ТМЦВЭксплуатацииКлиентСервер.ПараметрыПодбораТМЦВЭксплуатации.
// 
// Возвращаемое значение:
//  Структура - Описание запроса для выбора партии ТМЦ:
// 		* ТекстЗапроса - Строка - Текст запроса.
// 		* ПараметрыЗапроса - Структура - Параметры запроса.
Функция ОписаниеЗапросаДляВыбораПартииТМЦ_УТ(Параметры) Экспорт
	
	ТекстЗапроса =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ПартииТМЦ.Ссылка КАК Ссылка
	|
	|ПОМЕСТИТЬ ПартииТМЦ
	|
	|ИЗ
	|	Справочник.ПартииТМЦВЭксплуатации КАК ПартииТМЦ
	|
	|ГДЕ
	|	ПартииТМЦ.ДатаЗавершенияЭксплуатации >= &ОтборДата
	|	И НЕ ПартииТМЦ.ПометкаУдаления
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 10
	|	ТМЦВЭксплуатации.Организация КАК Организация,
	|	ТМЦВЭксплуатации.Подразделение КАК Подразделение,
	|	ТМЦВЭксплуатации.ФизическоеЛицо КАК ФизическоеЛицо,
	|	ТМЦВЭксплуатации.Номенклатура КАК Номенклатура,
	|	ТМЦВЭксплуатации.Характеристика КАК Характеристика,
	|	ЛОЖЬ КАК ИнвентарныйУчет,
	|	ИСТИНА КАК УчетПоФизЛицам,
	|	ТМЦВЭксплуатации.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|	ТМЦВЭксплуатации.ДатаЗавершенияЭксплуатации КАК ДатаЗавершенияЭксплуатации,
	|
	|	СУММА(ТМЦВЭксплуатации.Количество) КАК Количество
	|
	|ИЗ
	|	(ВЫБРАТЬ
	|		ТаблицаТовары.Ссылка.Организация КАК Организация,
	|		ТаблицаТовары.Ссылка.Подразделение КАК Подразделение,
	|		ТаблицаТовары.ФизическоеЛицо КАК ФизическоеЛицо,
	|		ТаблицаТовары.Номенклатура КАК Номенклатура,
	|		ТаблицаТовары.Характеристика КАК Характеристика,
	|		ТаблицаТовары.Ссылка.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|		ТаблицаТовары.Партия.ДатаЗавершенияЭксплуатации КАК ДатаЗавершенияЭксплуатации,
	|		ТаблицаТовары.Количество КАК Количество
	|		
	|	ИЗ
	|		Документ.ВнутреннееПотребление.Товары КАК ТаблицаТовары
	|
	|	ГДЕ
	|		ТаблицаТовары.Партия В
	|			(ВЫБРАТЬ
	|				ПартииТМЦ.Ссылка
	|			ИЗ
	|				ПартииТМЦ КАК ПартииТМЦ)
	|		И ТаблицаТовары.Ссылка.Проведен
	|
	|		И (ТаблицаТовары.Ссылка.Организация = &ОтборОрганизация
	|			ИЛИ &ОтборОрганизация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка))
	|
	|		И (ТаблицаТовары.Ссылка.Подразделение = &ОтборПодразделение
	|			ИЛИ &ОтборПодразделение = ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка))
	|
	|		И (&ПодборПоДаннымСтроки
	|			ИЛИ ТаблицаТовары.ФизическоеЛицо = &ОтборФизическоеЛицо
	|			ИЛИ &ОтборФизическоеЛицо = ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка))
	|
	|		И (НЕ &ПодборПоДаннымСтроки
	|			ИЛИ ТаблицаТовары.Номенклатура = &ОтборНоменклатура
	|				И ТаблицаТовары.Характеристика = &ОтборХарактеристика
	|				И ТаблицаТовары.ФизическоеЛицо = &ОтборФизическоеЛицо)
	|
	|	ОБЪЕДИНИТЬ ВСЕ
	|
	|	ВЫБРАТЬ
	|		ТаблицаТовары.Ссылка.Организация КАК Организация,
	|		ТаблицаТовары.Ссылка.Подразделение КАК Подразделение,
	|		ТаблицаТовары.ФизическоеЛицо КАК ФизическоеЛицо,
	|		ТаблицаТовары.Номенклатура КАК Номенклатура,
	|		ТаблицаТовары.Характеристика КАК Характеристика,
	|		ТаблицаТовары.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|		ТаблицаТовары.Партия.ДатаЗавершенияЭксплуатации КАК ДатаЗавершенияЭксплуатации,
	|		ТаблицаТовары.Количество КАК Количество
	|	ИЗ
	|		Документ.ВводОстатковТМЦВЭксплуатации.ТМЦВЭксплуатации КАК ТаблицаТовары
	|
	|	ГДЕ
	|		ТаблицаТовары.Партия В
	|			(ВЫБРАТЬ
	|				ПартииТМЦ.Ссылка
	|			ИЗ
	|				ПартииТМЦ КАК ПартииТМЦ)
	|		И ТаблицаТовары.Ссылка.Проведен
	|
	|		И (ТаблицаТовары.Ссылка.Организация = &ОтборОрганизация
	|			ИЛИ &ОтборОрганизация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка))
	|
	|		И (ТаблицаТовары.Ссылка.Подразделение = &ОтборПодразделение
	|			ИЛИ &ОтборПодразделение = ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка))
	|
	|		И (&ПодборПоДаннымСтроки
	|			ИЛИ ТаблицаТовары.ФизическоеЛицо = &ОтборФизическоеЛицо
	|			ИЛИ &ОтборФизическоеЛицо = ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка))
	|
	|		И (НЕ &ПодборПоДаннымСтроки
	|			ИЛИ ТаблицаТовары.Номенклатура = &ОтборНоменклатура
	|				И ТаблицаТовары.Характеристика = &ОтборХарактеристика
	|				И ТаблицаТовары.ФизическоеЛицо = &ОтборФизическоеЛицо)
	|
	|	ОБЪЕДИНИТЬ ВСЕ
	|
	|	ВЫБРАТЬ
	|		ТаблицаТовары.Ссылка.Организация КАК Организация,
	|		ТаблицаТовары.Ссылка.Подразделение КАК Подразделение,
	|		ТаблицаТовары.ФизическоеЛицо КАК ФизическоеЛицо,
	|		ТаблицаТовары.Номенклатура КАК Номенклатура,
	|		ТаблицаТовары.Характеристика КАК Характеристика,
	|		ТаблицаТовары.Ссылка.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|		ТаблицаТовары.Партия.ДатаЗавершенияЭксплуатации КАК ДатаЗавершенияЭксплуатации,
	|		ТаблицаТовары.Количество КАК Количество
	|	ИЗ
	|		Документ.ВводОстатков.ТМЦВЭксплуатации КАК ТаблицаТовары
	|
	|	ГДЕ
	|		ТаблицаТовары.Партия В
	|			(ВЫБРАТЬ
	|				ПартииТМЦ.Ссылка
	|			ИЗ
	|				ПартииТМЦ КАК ПартииТМЦ)
	|		И ТаблицаТовары.Ссылка.Проведен
	|
	|		И (ТаблицаТовары.Ссылка.Организация = &ОтборОрганизация
	|			ИЛИ &ОтборОрганизация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка))
	|
	|		И (ТаблицаТовары.Ссылка.Подразделение = &ОтборПодразделение
	|			ИЛИ &ОтборПодразделение = ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка))
	|
	|		И (&ПодборПоДаннымСтроки
	|			ИЛИ ТаблицаТовары.ФизическоеЛицо = &ОтборФизическоеЛицо
	|			ИЛИ &ОтборФизическоеЛицо = ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка))
	|
	|		И (НЕ &ПодборПоДаннымСтроки
	|			ИЛИ ТаблицаТовары.Номенклатура = &ОтборНоменклатура
	|				И ТаблицаТовары.Характеристика = &ОтборХарактеристика
	|				И ТаблицаТовары.ФизическоеЛицо = &ОтборФизическоеЛицо)
	|
	|	ОБЪЕДИНИТЬ ВСЕ
	|
	|	ВЫБРАТЬ
	|		ТаблицаТовары.Ссылка.Организация КАК Организация,
	|		ТаблицаТовары.Ссылка.Подразделение КАК Подразделение,
	|		ТаблицаТовары.ФизическоеЛицо КАК ФизическоеЛицо,
	|		ТаблицаТовары.Номенклатура КАК Номенклатура,
	|		ТаблицаТовары.Характеристика КАК Характеристика,
	|		ТаблицаТовары.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|		ТаблицаТовары.ДатаЗавершенияЭксплуатации КАК ДатаЗавершенияЭксплуатации,
	|		-ТаблицаТовары.Количество КАК Количество
	|		
	|	ИЗ
	|		Документ.ПрочееОприходованиеТоваров.Товары КАК ТаблицаТовары
	|
	|	ГДЕ
	|		ТаблицаТовары.ДатаЗавершенияЭксплуатации >= &ОтборДата
	|		И ТаблицаТовары.Ссылка.Дата <= &ОтборДата
	|		И ТаблицаТовары.Ссылка.Проведен
	|		И ТаблицаТовары.Ссылка.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВозвратИзЭксплуатации)
	|
	|		И (ТаблицаТовары.Ссылка.Организация = &ОтборОрганизация
	|			ИЛИ &ОтборОрганизация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка))
	|
	|		И (ТаблицаТовары.Ссылка.Подразделение = &ОтборПодразделение
	|			ИЛИ &ОтборПодразделение = ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка))
	|
	|		И (&ПодборПоДаннымСтроки
	|			ИЛИ ТаблицаТовары.ФизическоеЛицо = &ОтборФизическоеЛицо
	|			ИЛИ &ОтборФизическоеЛицо = ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка))
	|
	|		И (НЕ &ПодборПоДаннымСтроки
	|			ИЛИ ТаблицаТовары.Номенклатура = &ОтборНоменклатура
	|				И ТаблицаТовары.Характеристика = &ОтборХарактеристика
	|				И ТаблицаТовары.ФизическоеЛицо = &ОтборФизическоеЛицо)
	|			
	|	) КАК ТМЦВЭксплуатации
	|
	|СГРУППИРОВАТЬ ПО
	|	ТМЦВЭксплуатации.Организация,
	|	ТМЦВЭксплуатации.Подразделение,
	|	ТМЦВЭксплуатации.ФизическоеЛицо,
	|	ТМЦВЭксплуатации.Номенклатура,
	|	ТМЦВЭксплуатации.Характеристика,
	|	ТМЦВЭксплуатации.НаправлениеДеятельности,
	|	ТМЦВЭксплуатации.ДатаЗавершенияЭксплуатации
	|
	|ИМЕЮЩИЕ
	|	СУММА(ТМЦВЭксплуатации.Количество) > 0";
	
	Если НЕ Параметры.ДляДинамическогоСписка Тогда
		
		ТекстЗапроса = ТекстЗапроса + "
		|
		|УПОРЯДОЧИТЬ ПО
		|	Организация,
		|	Подразделение,
		|	ФизическоеЛицо,
		|	Номенклатура,
		|	Характеристика,
		|	НаправлениеДеятельности";
		
	КонецЕсли;
	
	ОтборДата = ?(
		Параметры.Дата <> Неопределено И Параметры.Дата <> '000101010000', 
		КонецДня(Параметры.Дата) + 1, 
		'000101010000');
	
	ОтборОрганизация = ?(
		Параметры.Организация <> Неопределено, 
		Параметры.Организация, 
		ПредопределенноеЗначение("Справочник.Организации.ПустаяСсылка"));

	ОтборПодразделение = ?(
		Параметры.Подразделение <> Неопределено, 
		Параметры.Подразделение, 
		ПредопределенноеЗначение("Справочник.СтруктураПредприятия.ПустаяСсылка"));

	ОтборНоменклатура = ?(
		Параметры.Номенклатура <> Неопределено, 
		Параметры.Номенклатура, 
		ПредопределенноеЗначение("Справочник.Номенклатура.ПустаяСсылка"));

	ОтборХарактеристика = ?(
		Параметры.Характеристика <> Неопределено, 
		Параметры.Характеристика, 
		ПредопределенноеЗначение("Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка"));

	ОтборФизическоеЛицо = ?(
		Параметры.ФизическоеЛицо <> Неопределено, 
		Параметры.ФизическоеЛицо, 
		ПредопределенноеЗначение("Справочник.ФизическиеЛица.ПустаяСсылка"));
	
	
	ПодборПоДаннымСтроки = 
		Параметры.Номенклатура <> Неопределено
		ИЛИ Параметры.Характеристика <> Неопределено;
	
	Если Параметры.ДляДинамическогоСписка Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "РАЗРЕШЕННЫЕ ПЕРВЫЕ 10", "");
	КонецЕсли;
	
	Если Параметры.ВыбратьПервые > 0 Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ПЕРВЫЕ 10", "ПЕРВЫЕ" + " " + Формат(Параметры.ВыбратьПервые, "ЧГ=0;"));
	Иначе
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ПЕРВЫЕ 10", "");
	КонецЕсли;
	
	ПараметрыЗапроса = Новый Структура;
	ПараметрыЗапроса.Вставить("ОтборДата", ОтборДата);
	ПараметрыЗапроса.Вставить("ОтборОрганизация", ОтборОрганизация);
	ПараметрыЗапроса.Вставить("ОтборПодразделение", ОтборПодразделение);
	ПараметрыЗапроса.Вставить("ОтборНоменклатура", ОтборНоменклатура);
	ПараметрыЗапроса.Вставить("ОтборХарактеристика", ОтборХарактеристика);
	ПараметрыЗапроса.Вставить("ОтборФизическоеЛицо", ОтборФизическоеЛицо);
	ПараметрыЗапроса.Вставить("ПодборПоДаннымСтроки", ПодборПоДаннымСтроки);
	
	ОписаниеЗапросаДляВыбора = Новый Структура("ТекстЗапроса,ПараметрыЗапроса", ТекстЗапроса, ПараметрыЗапроса);
	
	Возврат ОписаниеЗапросаДляВыбора;
	
КонецФункции

#КонецОбласти

#КонецОбласти
